app/Http/Controllers/CartController.php

	public function add(Request $request)
	{
		$item = (new Cart)->findItem($request);
		$user_id = Auth::id();//ログインユーザーID
		$count = $request->count;//追加されたitemの個数
		$subtotal = $item->price * $count;//小計
		$valdatedData = $request->validate([
			'count' => "integer|min:1|max:{$item->stock}",
		], [
			'count.max' => '在庫数以上は選択できません',
		]);

		$cart_item = Cart::firstOrCreate([
			'user_id' => $user_id,
			'item_id' => $item->id
		], [
			'count' => $count,
			'subtotal' => $subtotal
		]);
		DB::transaction(function () use ($request, $cart_item, $item,  $subtotal) {
			//追加された個数を在庫数から減少
			$item->decrement('stock', $request->count);
---
select * from `carts` where (`user_id` = 1 and `item_id` = 3) and `carts`.`deleted_at` is null limit 1
update `items` set `stock` = `stock` - 1, `updated_at` = '2020-03-08 22:00:43' where `id` = 3