app/Http/Controllers/ItemController.php

select * from `items`
---
	public function index()
	{
		$items = Item::get();

select * from `items` where `items`.`id` = '2' limit 1
---
	public function detail($id)
	{
		$item = Item::findOrFail($id);