app/Models/Cart.php

	public function getCart()
	{
		$id = Auth::id();
		$carts = Cart::where('user_id', $id)->get();
---
select * from `carts` where `user_id` = 1 and `carts`.`deleted_at` is null

	public function findItem($request)
	{
		$item_id = $request->item_id;//追加されたitemのID
		$item = Item::where('id', $item_id)->first();
---
select * from `items` where `id` = '3' limit 1