app/Http/Controllers/Admin/ItemController.php

	public function index()
	{
		$items = Item::get();
---
select * from `items`

	public function detail($id)
	{
		$item = Item::findOrFail($id);
---
select * from `items` where `items`.`id` = '6' limit 1